In [2]:
#import libraries
import pandas as pd
import numpy as np

In [3]:
#load csv file data with headers

location = "MCG.csv"
df = pd.read_csv(location)

In [4]:
#describe stats for the data
df.describe()

               Age  Length Of Service
count  9243.000000        9243.000000
mean     47.217137          12.845072
std      12.042355           9.311613
min      20.000000           0.000000
25%      37.000000           5.000000
50%      48.000000          12.000000
75%      57.000000          19.000000
max      91.000000          54.000000

In [5]:
df.head()

,Generation,Age,Ethnic Origin,Gender,Length Of Service,Job Class,Grade,Assignment Category,Salary Range
0,Generation X,42,White (Not Hispanic or Latino),Female,14,NON_MLS,25,Fulltime-Regular,90-99K
1,Generation X,44,Hispanic or Latino,Male,1,NON_MLS,15,Fulltime-Regular,40-49K
2,Generation X,41,Black or African American (Not Hispanic or Lat...,Female,11,NON_MLS,15,Fulltime-Regular,50-59K
3,Generation X,47,White (Not Hispanic or Latino),Male,12,NON_MLS,15,Fulltime-Regular,50-59K
4,Baby Boomers,59,Black or African American (Not Hispanic or Lat...,Female,2,NON_MLS,14,Fulltime-Regular,40-49K

In [6]:
df.tail()

,Generation,Age,Ethnic Origin,Gender,Length Of Service,Job Class,Grade,Assignment Category,Salary Range
9238,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9239,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9240,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9241,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9242,Generation X,51,Hispanic or Latino,Male,23,NON_MLS,P4,Fulltime-Regular,90-99K

In [7]:
df.shape

(9243, 9)

In [8]:
#show the column names in the dataset
df.columns

Index(['Generation', 'Age', 'Ethnic Origin', 'Gender', 'Length Of Service',
       'Job Class', 'Grade', 'Assignment Category', 'Salary Range'],
      dtype='object')

In [9]:
#show the data type of each column
df.dtypes

Generation             object
Age                     int64
Ethnic Origin          object
Gender                 object
Length Of Service       int64
Job Class              object
Grade                  object
Assignment Category    object
Salary Range           object
dtype: object

In [10]:
#number of non-NA values
#len(df) would count rows including NA values
df.count()

Generation             9243
Age                    9243
Ethnic Origin          9243
Gender                 9243
Length Of Service      9243
Job Class              9243
Grade                  9243
Assignment Category    9243
Salary Range           9243
dtype: int64

In [12]:
df['Age'].mean()

47.21713729308666

In [13]:
df['Age'].min()

20

In [14]:
df['Age'].max()

91

In [19]:
#Age frequency
df['Age'].value_counts()

49    295
50    290
52    264
48    258
55    257
47    255
56    254
57    251
58    248
54    246
51    245
53    244
46    237
36    229
39    229
45    227
34    226
43    223
40    222
60    220
41    217
37    211
42    211
59    209
38    209
32    208
61    208
33    204
35    193
44    188
     ...
66    123
26     90
67     90
68     79
25     74
70     58
69     56
71     40
24     40
72     27
23     24
22     16
73     16
74     14
76     11
21      6
80      5
79      5
75      4
77      4
78      4
81      3
83      2
20      2
82      1
90      1
88      1
85      1
86      1
91      1
Name: Age, Length: 69, dtype: int64

In [17]:
df['Age'].median()

48.0

In [18]:
df['Age'].mean()

47.21713729308666

In [22]:
#standard deviation
df['Age'].std()

12.042354766224056

In [23]:
print(df.groupby('Gender'))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002418839EBA8>

In [24]:
#use two columns to groupby
df.groupby(['Gender', 'Age']).mean()

            Length Of Service
Gender Age
Female 20            1.000000
       21            1.500000
       22            1.000000
       23            1.500000
       24            1.500000
       25            1.869565
       26            2.153846
       27            2.718750
       28            3.193548
       29            3.473684
       30            3.419355
       31            3.953846
       32            4.270270
       33            4.753623
       34            5.385714
       35            6.291667
       36            6.450000
       37            7.298507
       38            8.040000
       39            8.584270
       40            9.653846
       41            9.328767
       42            9.574713
       43            9.833333
       44            8.907692
       45            9.905882
       46           11.963855
       47           10.752809
       48           11.300000
       49           14.136364
...                       ...
Male   55           16.465649
       56           17.424242
       57           16.935714
       58           17.480000
       59           17.718447
       60           17.770642
       61           17.716981
       62           18.269231
       63           18.238636
       64           17.060976
       65           17.018519
       66           17.250000
       67           17.947368
       68           19.166667
       69           16.090909
       70           16.000000
       71           17.111111
       72           19.411765
       73           15.333333
       74           17.833333
       75           10.500000
       76           25.714286
       78           12.500000
       79           26.000000
       80           16.333333
       81           34.000000
       85           12.000000
       88           18.000000
       90           17.000000
       91           11.000000

[129 rows x 1 columns]

In [28]:
#Mean age by gender
pd.pivot_table(df, values=['Age'], index=['Gender'])

              Age
Gender
Female  49.437216
Male    45.711692

In [29]:
df['Age'].unique()

array([42, 44, 41, 47, 59, 73, 60, 50, 39, 40, 58, 65, 49, 38, 45, 36, 57,
       56, 29, 46, 43, 51, 52, 48, 33, 55, 25, 35, 79, 62, 74, 32, 34, 28,
       69, 54, 66, 37, 26, 53, 30, 61, 27, 63, 68, 64, 70, 24, 77, 31, 72,
       71, 22, 21, 67, 80, 75, 23, 78, 20, 88, 76, 83, 85, 86, 82, 81, 90,
       91], dtype=int64)

In [32]:
#find missing values
filename = "MCG.csv"
df_missing = pd.read_csv(filename)

In [33]:
#total missing values
df_missing.isnull().sum()

Generation             0
Age                    0
Ethnic Origin          0
Gender                 0
Length Of Service      0
Job Class              0
Grade                  0
Assignment Category    0
Salary Range           0
dtype: int64

In [36]:
#Unique grade values employees
grade = df['Grade'].unique()

In [37]:
print(len(grade))

70

In [38]:
df.shape

(9243, 9)

In [40]:
df_missing.shape
#no missing values

(9243, 9)

In [46]:
#float(df['Salary Range']).median()

In [50]:
#Count number of unique salary ranges
salary = df['Salary Range'].unique()
print(salary)

['90-99K' '40-49K' '50-59K' '>=150K' '70-79K' '130-139K' '80-89K' '60-69K'
 '100-109K' '110-119K' '140-149K' 'UnAssigned' '30-39K' '120-129K'
 '20-29K' '<20K']

In [51]:
df['Salary Range'].dtypes

dtype('O')

In [ ]:
# Create names for the four groups
group_names = ['F', 'D', 'C', 'B', 'A']

#make new column with letter grades
df['lettergrade'] = pd.cut(df['grade'], bins, labels=group_names)
df.head()

In [53]:
df['Salary Range'].value_counts()

60-69K        1265
70-79K        1263
50-59K        1179
90-99K        1119
80-89K         978
40-49K         839
100-109K       824
110-119K       348
30-39K         298
120-129K       275
20-29K         197
>=150K         182
140-149K       146
130-139K       133
UnAssigned     113
<20K            84
Name: Salary Range, dtype: int64

In [54]:
df['Ethnic Origin'].value_counts()

White (Not Hispanic or Latino)                                 4501
Black or African American (Not Hispanic or Latino)             2469
Hispanic or Latino                                              972
Asian (Not Hispanic or Latino)                                  629
Unreported                                                      525
Two or More Races (Not Hispanic or Latino)                      104
American Indian or Alaska Native (Not Hispanic or Latino)        34
Native Hawaiian/Other Pacific Islander(Not Hispanic/Latino)       9
Name: Ethnic Origin, dtype: int64

In [55]:
df.groupby(['Gender', 'Ethnic Origin']).mean()

                                                                 Age  \
Gender Ethnic Origin
Female American Indian or Alaska Native (Not Hispanic ...  46.666667
       Asian (Not Hispanic or Latino)                      51.801205
       Black or African American (Not Hispanic or Latino)  49.185756
       Hispanic or Latino                                  46.193684
       Native Hawaiian/Other Pacific Islander(Not Hisp...  43.000000
       Two or More Races (Not Hispanic or Latino)          39.407407
       Unreported                                          43.411765
       White (Not Hispanic or Latino)                      51.176434
Male   American Indian or Alaska Native (Not Hispanic ...  45.080000
       Asian (Not Hispanic or Latino)                      48.572391
       Black or African American (Not Hispanic or Latino)  48.546154
       Hispanic or Latino                                  43.907445
       Native Hawaiian/Other Pacific Islander(Not Hisp...  45.375000
       Two or More Races (Not Hispanic or Latino)          36.020000
       Unreported                                          40.816199
       White (Not Hispanic or Latino)                      45.040972

                                                           Length Of Service
Gender Ethnic Origin
Female American Indian or Alaska Native (Not Hispanic ...          13.444444
       Asian (Not Hispanic or Latino)                              12.888554
       Black or African American (Not Hispanic or Latino)          12.883542
       Hispanic or Latino                                          11.376842
       Native Hawaiian/Other Pacific Islander(Not Hisp...          18.000000
       Two or More Races (Not Hispanic or Latino)                   5.166667
       Unreported                                                   5.759804
       White (Not Hispanic or Latino)                              14.735965
Male   American Indian or Alaska Native (Not Hispanic ...          17.880000
       Asian (Not Hispanic or Latino)                              11.542088
       Black or African American (Not Hispanic or Latino)          11.924476
       Hispanic or Latino                                          10.814889
       Native Hawaiian/Other Pacific Islander(Not Hisp...          10.750000
       Two or More Races (Not Hispanic or Latino)                   4.560000
       Unreported                                                   6.286604
       White (Not Hispanic or Latino)                              14.425000

In [56]:
#make numeric value column based on string value column

#create a function that will return 1 if female and 0 if male
def score_to_numeric(x):
    if x=='female':
        return 1
    if x=='male':
        return 0
    
df['gender_val'] = df_missing['Gender'].apply(score_to_numeric)
df_missing.tail()

,Generation,Age,Ethnic Origin,Gender,Length Of Service,Job Class,Grade,Assignment Category,Salary Range
9238,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9239,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9240,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9241,Millennial Generation,29,White (Not Hispanic or Latino),Male,5,NON_MLS,P4,Fulltime-Regular,60-69K
9242,Generation X,51,Hispanic or Latino,Male,23,NON_MLS,P4,Fulltime-Regular,90-99K

In [62]:
df.groupby(['Gender', 'Assignment Category']).mean()

                                  Age  Length Of Service
Gender Assignment Category
Female Fulltime-Regular     48.643296          13.216155
       Parttime-Regular     53.276562          11.945312
Male   Fulltime-Regular     45.617499          12.925594
       Parttime-Regular     48.880503           6.534591

In [64]:
df['Assignment Category'].value_counts()

Fulltime-Regular    8444
Parttime-Regular     799
Name: Assignment Category, dtype: int64

In [66]:
df['Gender'].value_counts()

Male      5508
Female    3735
Name: Gender, dtype: int64

In [67]:
df['Assignment Category'].value_counts()

Fulltime-Regular    8444
Parttime-Regular     799
Name: Assignment Category, dtype: int64